In [2]:
import mysql.connector as sql

In [5]:
connection = sql.connect(
    
    host = "localhost",
    user = "root",
    password = "Shu@1995",
    database = "student"
)

print(connection)

<mysql.connector.connection_cext.CMySQLConnection object at 0x0000009F89CE4DC8>

## Creating Database

In [6]:
cursor = connection.cursor()
cursor.execute("CREATE TABLE studentinfo(id INT AUTO_INCREMENT PRIMARY KEY, name VARCHAR(255), Subject VARCHAR(255))")

## Insert Records in Table

In [7]:
query = "INSERT INTO studentinfo(name, Subject) VALUES (%s, %s)"
value = ("John", "Math")
cursor.execute(query,value)
print("Row inserted",cursor.lastrowid)

Row inserted 1

In [8]:
### Insert multiple records in Table
query = "INSERT INTO studentinfo (name, Subject) VALUES (%s, %s)"
values = [("Krish", "Science"),
        ("Joe", "History"),
        ("Ankur","Maths"),
        ("Paul","Science"),
        ("Vishal","English"),
        ("Krish","Maths")]
cursor.executemany(query,values)
print("Row inserted",cursor.lastrowid)

Row inserted 2

## Select all

selects all the columns from the "studentinfo" table

In [13]:
cursor= connection.cursor()
cursor.execute("Select * from studentinfo")

fetchall() fetches all the rows of a query result. It returns all the rows as a list of tuples. An empty list is returned if there is no record to fetch

In [10]:
cursor.fetchall()

[(1, 'John', 'Math'),
 (2, 'Krish', 'Science'),
 (3, 'Joe', 'History'),
 (4, 'Ankur', 'Maths'),
 (5, 'Paul', 'Science'),
 (6, 'Vishal', 'English'),
 (7, 'Krish', 'Maths')]

In [11]:
### Fetch One Record At A time
cursor.fetchone()

In [14]:
lst = cursor.fetchall()
lst

[(1, 'John', 'Math'),
 (2, 'Krish', 'Science'),
 (3, 'Joe', 'History'),
 (4, 'Ankur', 'Maths'),
 (5, 'Paul', 'Science'),
 (6, 'Vishal', 'English'),
 (7, 'Krish', 'Maths')]

## Select Particular Columns

In [15]:
cursor.execute("Select subject from studentinfo")
### Fetch all
cursor.fetchall()

[('Math',),
 ('Science',),
 ('History',),
 ('Maths',),
 ('Science',),
 ('English',),
 ('Maths',)]

The SELECT DISTINCT statement is used to return only distinct (different) values.

Inside a table, a column often contains many duplicate values; and sometimes you only want to list the different (distinct) values

In [16]:
##Select Disctinct Columns 
cursor.execute("SELECT DISTINCT subject from studentinfo")
##fetchall
cursor.fetchall()

[('Math',), ('Science',), ('History',), ('Maths',), ('English',)]

## Drop Table

The DROP TABLE statement is used to drop an existing table in a database

In [17]:
cursor.execute("DROP TABLE studentinfo")